**** COMMENT 函数作为参数
函数作为参数最典型的应用要数 map 了，想必如果没有使用过 Underscore，也或多或少会用过 ECMAScript 5 中 Array 的 map 方法吧。

#+BEGIN_SRC js
  [1, 2, 3, 4].map(function(x) {
    return ++x;
  });
#+END_SRC

#+RESULTS:
: Please install 'z' first!
: hehe
: undefined

可以看到函数 =function(x){return x++}= 是作为参数被传入 Array 的 =map= 方法中。map 是函数式编程最常见的标志性函数，想想在 ECMAScript 5 出来之前应该怎么做类似的事情：

#+BEGIN_SRC js
  var array = [1, 2, 3, 4];
  var result = [];
  for(var i in array){
    result.push(++i);
  }

#+END_SRC

这段命令式的代码跟利用 map 的函数式代码解决问题的方式和角度是完全不同的。命令式需要操心所有的过程，如何遍历以及如何组织结果数据。而 map 由于将遍历，操作以及结果数据的组织的过程封装至 Array 中，从而参数化了最核心过程。而这里的核心过程就是 map 的参数里的匿名函数中的过程，也是我们真正关心的主要逻辑。

